---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BuildingCurveGstyle
source: html/7f2ba43b-886f-646a-aa39-28105bab25d3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BuildingCurveGstyle Property

"Line Style"

## Syntax (C#)
```csharp
public static ForgeTypeId BuildingCurveGstyle { get; }
```